-- Lesson 38 - Comparison Functions - In, Not In
-- Video: https://www.youtube.com/watch?v=db3skJVH3Jg

-- Comparison Function Syntax:

-- IN(Values)       -- القيمة موجودة ضمن القائمة
-- NOT IN(Values)   -- القيمة ليست ضمن القائمة

-- ===========================================================

-- تجهيز
CREATE DATABASE IF NOT EXISTS test;
USE test;
DROP TABLE IF EXISTS try;
CREATE TABLE try(id INT UNIQUE AUTO_INCREMENT, name VARCHAR(255), date DATETIME, number INT);
INSERT INTO try(name, date, number) VALUES
    ('Mohammed', '2017-04-24 16:10:42', 1),
    ('Mostafa', '2021-01-19 02:40:25', 2),
    ('Albasha', '2019-10-01 11:00:00', 3),
    ('Gamal', '2024-04-03 00:00:00', 4),
    ('Shamah', '2026-04-18 12:51:06', 5),
    ('Marwa', '2025-05-03 00:00:00', 6);

SELECT * FROM try WHERE number IN (2, 4, 5);

-- +----+---------+---------------------+--------+
-- | id | name    | date                | number |
-- +----+---------+---------------------+--------+
-- |  2 | Mostafa | 2021-01-19 02:40:25 |      2 |
-- |  4 | Gamal   | 2024-04-03 00:00:00 |      4 |
-- |  5 | Shamah  | 2026-04-18 12:51:06 |      5 |
-- +----+---------+---------------------+--------+

-- ──────────────────────────────────────────────────────────

SELECT * FROM try WHERE number NOT IN (2, 4, 5);

-- +----+----------+---------------------+--------+
-- | id | name     | date                | number |
-- +----+----------+---------------------+--------+
-- |  1 | Mohammed | 2017-04-24 16:10:42 |      1 |
-- |  3 | Albasha  | 2019-10-01 11:00:00 |      3 |
-- |  6 | Marwa    | 2025-05-03 00:00:00 |      6 |
-- +----+----------+---------------------+--------+

-- ──────────────────────────────────────────────────────────

SELECT * FROM try WHERE date IN ('2017-04-24', '2019-10-01');

-- Empty set

-- لم يجد شيئا، لأن العمود فيه وقت أيضا، و IN تبحث عن تطابق كامل

-- --------------

SELECT * FROM try WHERE date IN ('2017-04-24 16:10:42', '2019-10-01 11:00:00');

-- +----+----------+---------------------+--------+
-- | id | name     | date                | number |
-- +----+----------+---------------------+--------+
-- |  1 | Mohammed | 2017-04-24 16:10:42 |      1 |
-- |  3 | Albasha  | 2019-10-01 11:00:00 |      3 |
-- +----+----------+---------------------+--------+

-- ──────────────────────────────────────────────────────────

SELECT * FROM try WHERE date NOT IN ('2024-04-03');

-- +----+----------+---------------------+--------+
-- | id | name     | date                | number |
-- +----+----------+---------------------+--------+
-- |  1 | Mohammed | 2017-04-24 16:10:42 |      1 |
-- |  2 | Mostafa  | 2021-01-19 02:40:25 |      2 |
-- |  3 | Albasha  | 2019-10-01 11:00:00 |      3 |
-- |  5 | Shamah   | 2026-04-18 12:51:06 |      5 |
-- |  6 | Marwa    | 2025-05-03 00:00:00 |      6 |
-- +----+----------+---------------------+--------+

-- هنا وجد الصف لأن وقته 00:00:00، فاستبعده وأظهر الباقي
