-- Lesson 45 - Information Functions
-- Video: https://www.youtube.com/watch?v=TZZRIg_vBIU

-- Information Functions:

-- USER()                          -- يرجع اسم المستخدم المتصل بقاعدة البيانات واسم الجهاز (Host)
-- SESSION_USER()                  -- نفس عمل USER بالضبط
-- VERSION()                       -- يرجع إصدار نظام إدارة قواعد البيانات الذي أعمل عليه
-- DATABASE()                      -- يرجع اسم قاعدة البيانات التي أعمل عليها حاليا
-- CHARSET(Value)                  -- يرجع الترميز للقيمة التي أعطيه إياها
-- CONVERT(Value USING Charset)    -- يغير ترميز القيمة
-- CONNECTION_ID()                 -- رقم الاتصال الحالي

-- ملاحظة: نتائج هذا الدرس تختلف من جهاز لآخر، حسب المستخدم والإصدار والاتصال

-- ===========================================================

CREATE DATABASE IF NOT EXISTS test;
USE test;

SELECT USER();

-- +----------------+
-- | USER()         |
-- +----------------+
-- | root@localhost |
-- +----------------+

-- --------------------

SELECT SESSION_USER();

-- +----------------+
-- | SESSION_USER() |
-- +----------------+
-- | root@localhost |
-- +----------------+

-- --------------------

SELECT VERSION();

-- +-------------------------+
-- | VERSION()               |
-- +-------------------------+
-- | 8.0.46-0ubuntu0.24.04.4 |
-- +-------------------------+

-- --------------------

SELECT CHARSET(USER());

-- +-----------------+
-- | CHARSET(USER()) |
-- +-----------------+
-- | utf8mb3         |
-- +-----------------+

-- --------------------

SELECT CHARSET(CONVERT(USER() USING latin1)) AS Converted;

-- +-----------+
-- | Converted |
-- +-----------+
-- | latin1    |
-- +-----------+

-- --------------------

SELECT DATABASE();

-- +------------+
-- | DATABASE() |
-- +------------+
-- | test       |
-- +------------+

-- -------------------

SELECT CONNECTION_ID();

-- +-----------------+
-- | CONNECTION_ID() |
-- +-----------------+
-- |             233 |
-- +-----------------+
